#+title: Lists in R
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: Introduction to data science (DSC 105) Fall 2022
#+OPTIONS: toc:nil num:nil
#+STARTUP: overview hideblocks indent inlineimages
#+PROPERTY: header-args:R :session *R* :exports both :results output
* Removing, overwriting and slicing a ~list~

- To overwrite a list member, use the assignment operator ~<-~
  #+begin_src R
    foo[[3]]
    bar <- foo # safety copy
    bar[[3]] <- paste(foo[[3]], "world!")
    bar[[3]]
  #+end_src

- Here, ~paste~ concatenates strings but can also be used for output:
  #+begin_src R
    a <- "10,000"
    paste("a is", a)

    x <- 10000
    paste("x is", x)
  #+end_src

  #+RESULTS:
  : [1] "a is 10,000"
  : [1] "x is 10000"

- To remove a list member, overwrite it with ~NULL~ (like ~names~)
  #+begin_src R
    baz <- foo  # safety copy
    baz[[1]] <- NULL
    baz
  #+end_src

- /List slicing/ means selecting multiple list items at once:
  #+begin_src R
    foo[c(2,3)] # select list members 2 and 3
  #+end_src

- Note that the sliced list is itself a ~list~ 

* Naming lists

- List members can be /named/ just like vector or data frame elements

- A name is an R /attribute/. An unnamed list has none:
  #+begin_src R
    attributes(foo)
  #+end_src

- Name the members of ~foo~ using ~names~, then print ~str(foo)~:
  #+begin_src R
    names(foo) <- c(
      "mymatrix",
      "mylogicals",
      "mystring")
    str(foo)
  #+end_src

  #+RESULTS:
  : List of 3
  :  $ mymatrix  : int [1:2, 1:2] 1 2 3 4
  :  $ mylogicals: logi [1:4] TRUE FALSE TRUE TRUE
  :  $ mystring  : chr "hello"

- You can now use the names to subset the list as usual:
  1) Print the ~matrix~ member of ~foo~ (def'd [[foo][here]])
  2) Print the 2nd column of the ~matrix~ member
  3) Print the 2nd through 4th element of the ~logical~ member
  #+begin_src R
    foo$mymatrix      #1
    foo$mymatrix[,2]  #2
    foo$mylogicals[2:4]
  #+end_src

- Note that the ~names~ are stored as a ~character~ vector but not used
  with quotes. Also, you cannot use the names inside double brackets
  #+begin_src R
    vec <- c("a"=1,"b"=2)   # vector with two named elements
    names(vec)        # names of vector elements
    vec["a"]          # extracting element with name
    vec[1]            # extracting element with index
    vec[c("a","b")]   # extracting elements with names vector
    vec[c(1,2)]       # extracting elements with index vector
    n <- names(vec)   # storing names vector
    vec[n]            # extracting elements with names vector
  #+end_src

- You can also name the list when creating it with ~list~:
  #+begin_src R
    q <- list(
      "my name"="Adam",
      "my sons"= c("Kain", "Abel"))
    str(q)
  #+end_src
  
